/* function largest(num) {

}
var student = { name: "Yo Mama", age: 17 };
var i = delete student.age;
console.log(student)


 */


// ----------------------------------------------------------------
/* ৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো।  */

var i = 7;
while (i <= 19) {
    if (i % 2 != 0) {
        // console.log(i);
    }
    i++;
}

// ---------------------------------------------------------
// ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে।

/* const arr = [11, 25, 26, 45, 78, 7];
var arrLength = arr.length;
arr[3] = 99;
arr.push(3);
arr.unshift(6);
arr.pop();
arr.shift();
var tr = arr.indexOf(12);
var tr1 = arr[5]; // -1
console.log(tr1);

console.log(arr, arrLength);
 */

// -------------------------------------------------------------------

// ৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো। 

var arr = [4, 8, 7, 96, 78, 5, 5, 5, 45, 6, 5];
console.log(arr.length);

for (var i = 0; i < arr.length; i++) {
    const newArr = arr[i];
    // console.log(newArr);
}


